"""GENERATED FILE. DO NOT EDIT MANUALLY."""

CITY_ALL_AREAS = {
    "אשדוד - כל האזורים": [
        "אשדוד - א,ב,ד,ה",
        "אשדוד - איזור תעשייה צפוני",
        "אשדוד - ג,ו,ז",
        "אשדוד - ח,ט,י,יג,יד,טז",
        "אשדוד -יא,יב,טו,יז,מרינה,סיטי",
    ],
    "אשקלון - כל האזורים": ["אשקלון - דרום", "אשקלון - צפון"],
    "באר שבע - כל האזורים": [
        "באר שבע - דרום",
        "באר שבע - מזרח",
        "באר שבע - מערב",
        "באר שבע - צפון",
    ],
    "הרצליה - כל האזורים": ["הרצליה - מערב", "הרצליה - מרכז וגליל ים"],
    "חדרה - כל האזורים": [
        "חדרה - מזרח",
        "חדרה - מערב",
        "חדרה - מרכז",
        "חדרה - נווה חיים",
    ],
    "חיפה - כל האזורים": [
        "חיפה - כרמל, הדר ועיר תחתית",
        "חיפה - מערב",
        "חיפה - מפרץ",
        "חיפה - נווה שאנן ורמות כרמל",
        "חיפה - קריית חיים ושמואל",
    ],
    "ירושלים - כל האזורים": [
        "ירושלים - אזור תעשייה עטרות",
        "ירושלים - דרום",
        "ירושלים - כפר עקב",
        "ירושלים - מזרח",
        "ירושלים - מערב",
        "ירושלים - מרכז",
        "ירושלים - צפון",
    ],
    "נתניה - כל האזורים": ["נתניה - מזרח", "נתניה - מערב"],
    "עכו - כל האזורים": ["עכו", "עכו - אזור תעשייה"],
    "צפת - כל האזורים": ["צפת - נוף כנרת", "צפת - עיר", "צפת - עכברה"],
    "קריית ביאליק - כל האזורים": ["קריית ביאליק"],
    "ראשון לציון - כל האזורים": ["ראשון לציון - מזרח", "ראשון לציון - מערב"],
    "רמת גן - כל האזורים": ["רמת גן - מזרח", "רמת גן - מערב"],
    "תל אביב - כל האזורים": [
        "תל אביב - דרום העיר ויפו",
        "תל אביב - מזרח",
        "תל אביב - מרכז העיר",
        "תל אביב - עבר הירקון",
    ],
}
